# tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/services"
# tap "osx-cross/arm"
# tap "osx-cross/avr"
# tap "qmk/qmk"
# tap "strongdm/comply"

brew "ack"
# brew "little-cms2"
# brew "apr-util"
# brew "boost"
brew "python@3" #brew "python@3.11"
# brew "docutils"
# brew "awscli"
brew "bash-completion"
# brew "glib"
# brew "openssl@1.1"
# brew "python@3.9"
# brew "tcl-tk"
brew "circleci"
brew "cloc"
# brew "libssh2"
# brew "openldap"
# brew "rtmpdump"
# brew "curl"
# brew "freetds"
# brew "krb5"
# brew "libpq"
brew "php"
brew "composer"
# brew "folly"
# brew "edencommon"
# brew "nettle"
# brew "p11-kit"
# brew "unbound"
# brew "gnutls"
# brew "guile"
# brew "emacs"
# brew "fizz"
# brew "wangle"
# brew "fbthrift"
# brew "fb303"
# brew "gdk-pixbuf"
brew "gh"
brew "hub"

# brew "openjpeg"
# brew "ghostscript"
brew "git"
# brew "pinentry"
# brew "gnupg"
# brew "git-secret"
# brew "gobject-introspection"
# brew "netpbm"
# brew "python@3.8"
# brew "harfbuzz"
# brew "pango"
# brew "librsvg"
# brew "graphviz"
brew "hey"
brew "httpie"
# brew "hub"
brew "hugo"
# brew "shared-mime-info"
# brew "libheif"
# brew "imagemagick"
# brew "imagemagick@6"
brew "jq"
brew "openjdk"
# brew "leiningen"
# brew "libfido2"
# brew "libnfc"
# brew "libwebsockets"
brew "minikube"
# brew "mosquitto"
# brew "mysql-client"
# brew "nfcutils"
# brew "nghttp2"
brew "node"
brew "p7zip"
# brew "pillow"
# brew "pipenv"
brew "postgresql" # no easy way to install just psql
brew "pstree"
brew "pulumi"
# brew "pyenv"
# brew "python@3.10"
# brew "qrencode"
brew "reattach-to-user-namespace"
brew "ruby"
# brew "s3cmd"
# brew "smartmontools"
brew "tmux"
brew "tree"
brew "watchman"
brew "yarn"
brew "heroku/brew/heroku"
brew "qmk/qmk/qmk"

cask "1password"
cask "1password-cli"
cask "arduino"
cask "autodesk-fusion"
cask "balenaetcher"
cask "caffeine"
cask "dbeaver-community"
cask "devtunnel"
cask "docker"
cask "dropbox"
# cask "evernote"
# cask "gitup"
cask "google-chrome"
cask "google-cloud-sdk"
cask "graphiql"
# cask "intellij-idea-ce"
cask "keybase"
cask "keycastr"
cask "kindle"
cask "ngrok"
# cask "omnigraffle"
cask "openscad"
# cask "postman"
cask "prusaslicer"
cask "rar"
# cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
# cask "stretchly"
# cask "toggl"
# cask "tunnelblick"
cask "via"
cask "visual-studio-code"
cask "whatsapp"
cask "wkhtmltopdf"

vscode "andys8.jest-snippets"
vscode "anjali.clipboard-history"
vscode "ban.spellright"
vscode "chouzz.vscode-better-align"
vscode "circleci.circleci"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.wordcount"
vscode "nrwl.angular-console"
vscode "sourcegraph.cody-ai"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
